Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If you need more file descriptors than that, consider rebuilding Perl to use the C<sfio> library, or perhaps using the POSIX::open() function.
es_es: Si necesita más descriptores de archivo que esa cantidad, contemple la posibilidad de reconstruir Perl para que use la biblioteca C<sfio>, o tal vez usar la función estándar POSIX::open().

source: $t = @a[0, 1]; # $t is now 'second'
es_es: $t = @a[0, 1]; # $t es ahora 'segundo'

source: For example, the smart match operator short-circuits whenever possible, but C<grep> does not.
es_es: Por ejemplo, el operador de coincidencia inteligente intenta siempre abreviar donde sea posible, mientras que C<grep>, no.

source: These conversions are governed by the following general rules:
es_es: Estas conversiones obedecen las siguientes normas generales:

source: $re = qr{ \( (?: (?> [^()]+ ) # Non-parens without backtracking | (??{ $re }) # Group with matching parens )* \) }x;
es_es: $re = qr{ \( (?: (?> [^()]+ ) # No-paréntesis, sin retroceso | (??{ $re }) # Grupo con coincidencia de paréntesis )* \) }x;

source: In the first form, the return value of EXPR is parsed and executed as if it were a little Perl program.
es_es: En la primera forma, el valor devuelto por EXPR es interpretado y ejecutado como si fuera un pequeño programa Perl.

source: However, the above usage will create global variables throughout your program, which is bad programming practice.
es_es: Sin embargo, el uso anterior creará variables globales en todo el programa, algo que no se recomienda en programación.

source: ASCII semantics are used for the case change.
es_es: Semántica ASCII es utilizada para el cambio de tamaño de caja.

source: For example, parallelism means "awk and perl" and "Python and Perl" look good, while "awk and Perl" and "Python and perl" do not.
es_es: Por ejemplo, por paralelismo podemos intuir que "awk y perl" y "Python y Perl" son aceptables, mientras que "awk y Perl" y "Python y perl" no lo son.

source: @lines = (" - Foo", "01 - Bar", "1 - Baz", " - Quux");
es_es: @lineas = (" - Foo", "01 - Bar", "1 - Baz", " - Quux");

source: This should give end users more flexibility in their choice of upgrade timing, and allow them easier assessment of the impact of upgrades.
es_es: Esto debería dar a los usuarios finales una mayor flexibilidad en su elección del momento de la actualización, y permitir una evaluación más sencilla de los efectos de las actualizaciones.

source: Several of the core modules have been converted to use this feature for their system dependent constants - as a result C<use POSIX;> now takes about 200K less memory.
es_es: Varios de los módulos básicos se han convertido para usar esta característica para sus constantes dependientes del sistema - como resultado de esto, C<use POSIX;> ahora ocupa 200K menos de memoria.

source: Positive assertions match when their subpattern matches, negative assertions match when their subpattern fails.
es_es: Aserciones positivas coinciden cuando los subpatrones coinciden, aserciones negativas coinciden cuando fallan sus subpatrones.

source: Dave Mitchell improved the lexer debugging output under C<-DT>.
es_es: Dave Mitchell mejoró la salida de depuración del analizador léxico con C<-DT>.

source: For example,
es_es: Por ejemplo,

source: For example:
es_es: Por ejemplo:

source: =item Otherwise, if C<use feature 'unicode_strings'> is in effect:
es_es: =item De lo contrario, si C<use feature 'unicode_strings'> está activo:

source: Interpolation in patterns has several quirks: C<$|>, C<$(>, C<$)>, C<@+> and C<@-> are not interpolated, and constructs C<$var[SOMETHING]> are voted (by several different estimators) to be either an array element or C<$var> followed by an RE alternative.
es_es: La interpolación en los patrones tiene varias peculiaridades: C<$|>, C<$(>, C<$)>, C<@+> y C<@-> no son interpoladas, y construcciones C<$var[ALGO]> son promovidas (por varios estimadores diferentes) a ser un elemento de array o C<$var> seguida de una RE alternativa.

source: - Testing
es_es: - Comprobación

source: There are infinitely more reals than floats, so some corners must be cut.
es_es: Hay infinitamente más reales que flotantes, por lo que algunos detalles deben ser tenidos en cuenta.

source: Some operators return a count of successful operations.
es_es: Algunos operadores devuelven una cuenta del número de operaciones exitosas.

source: ABOUT PERL ==========
es_es: ACERCA DE PERL ==============

source: =head2 Floating-point Arithmetic X<floating-point> X<floating point> X<float> X<real>
es_es: =head2 Aritmética de punto flotante X<floating-point> X<floating point> X<float> X<real> X<punto flotante> X<flotante>

source: A class implementing an ordinary array should have the following methods:
es_es: Una clase implementando un array ordinario común debe tener los siguientes métodos:

source: For instance, whether C<< "a $b -> {c}" >> really means:
es_es: Por ejemplo, si C<< "a $b -> {c}" >> realmente significa:

source: # in-memory files
es_es: # archivos en memoria

source: Programs should rarely if ever make policy decisions better left to the user.
es_es: Los programas rara vez o nunca deben tomar decisiones políticas, que es mejor dejar al usuario.

source: Remember that a umask is a number, usually given in octal; it is I<not> a string of octal digits.
es_es: Recuerde que un umask es un número, generalmente indicado en octal; I<no> es una cadena de dígitos octales.

source: Modifiers that alter the way a regular expression is used by Perl are detailed in L<perlop/"Regexp Quote-Like Operators"> and L<perlop/"Gory details of parsing quoted constructs">.
es_es: Modificadores que alteran la forma en que una expresión regular es utilizada por Perl se detallan en L<perlop/"Operadores Regexp Entrecomillados"> y L<perlop/"Detalles sangrientos del análisis de las construcciones entrecomilladas">.

source: perlirix Perl notes for Irix
es_es: perlirix Notas para Irix

source: Current Perl's should handle this problem correctly.
es_es: El Perl actual debería manejar este problema correctamente.

source: =item qr/STRING/msixpodual X<qr> X</i> X</m> X</o> X</s> X</x> X</p>
es_es: =item qr/CADENA/msixpodual X<qr> X</i> X</m> X</o> X</s> X</x> X</p>

source: $XS_VERSION = $VERSION; # only needed if you have XS code
es_es: $XS_VERSION = $VERSION; # solo necesario si tiene código XS

source: Using an indirect object with C<exec> or C<system> is also more secure.
es_es: Usar un objeto indirecto con C<exec> o C<system> es también más seguro.

source: Several constructs above specify a character by a number.
es_es: Varias de las construcciones anteriores especifican un carácter a partir de un número.

source: return $result;
es_es: return $resultado;

source: In Perl 6, C<when()> will always do an implicit smart match with its argument, whilst it is convenient in Perl 5 to suppress this implicit smart match in certain situations, as documented above.
es_es: En Perl 6, C<when()> siempre hará una coincidencia inteligente con sus argumentos, mientras que en Perl 5 es conveniente suprimir esta coincidencia inteligente en ciertas situaciones, como se ha documentado anteriormente.

source: C<File::Glob> upgraded to version 1.05
es_es: C<File::Glob> actualizado a la versión 1.05

source: my @new = @old[ sort {
es_es: my @nuevo = @viejo[ sort {

source: Math::Cephes uses external Cephes C library (no big numbers)
es_es: Math::Cephes usa biblioteca externa en C Cephes (no para grandes números)

source: The expression \cI<x> matches the character control-I<x>.
es_es: La expresión \cI<x> coincide con el carácter control-I<x>.

source: This is useful for staying almost, but not entirely similar to C<die>.
es_es: Esto es útil para mantenerse casi, pero no del todo, similar a C<die>.

source: printf '<%#.0o>', 0; # prints "<0>"
es_es: printf '<%#.0o>', 0; # imprime "<0>"

source: Normally, sprintf() takes the next unused argument as the value to format for each format specification.
es_es: Normalmente, sprintf () toma el siguiente argumento utilizado como el valor de formato para cada especificación de formato.

source: Starting from Perl 5.10, you can say
es_es: A partir de Perl 5.10, puede decir

source: In a real sense, perl already I<is> commercial software: it has a license that you can grab and carefully read to your manager.
es_es: En realidad, perl I<es> software comercial: tiene una licencia que su jefe puede analizar minuciosamente.

source: =item getpriority WHICH,WHO X<getpriority> X<priority> X<nice>
es_es: =item getpriority CUÁL,QUIÉN X<getpriority> X<priority> X<nice> X<prioridad>

source: )* # any number of times
es_es: )* # cualquier número de veces

source: make test 1 hour 45 minutes
es_es: make test 1 hora 45 minutos

source: Options:
es_es: Opciones:

source: The filehandle is left open pointing to the contents after __DATA__.
es_es: El gestor de archivo se deja abierto apuntando al contenido que hay después de __DATA__.

source: If a tied hash is evaluated in scalar context, the C<SCALAR> method is called (with a fallback to C<FIRSTKEY>).
es_es: Si un hash enlazado (tie) es evaluado en contexto escalar, se llama al método C<SCALAR> (con una retrollamada a C<FIRSTKEY>).

source: Interpolating an array or slice interpolates the elements in order, separated by the value of C<$">, so is equivalent to interpolating C<join $", @array>.
es_es: Interpolando un array o una parte de él, es interpolar los elementos por orden, separándolos por el valor de C<$">, que es equivalente a C<join $", @array>.

source: Although this feature was to be run only right before your program was to exit, this is not currently so: the C<$SIG{__DIE__}> hook is currently called even inside eval()ed blocks/strings!
es_es: Aunque esta característica está preparada para ser ejecutada sólo antes de que el programa termine, así no es como se hace ahora: el gancho C<$SIG{__DIE__}>, ¡es llamado incluso dentro de cadenas y bloques eval()uados!

source: Use of C<defined> on aggregates (hashes and arrays) is deprecated.
es_es: El uso de C<defined> sobre datos agregados (hashes y arrays) está desaconsejado.

source: sysseek() bypasses normal buffered IO, so mixing it with reads other than C<sysread> (for example C<< <> >> or read()) C<print>, C<write>, C<seek>, C<tell>, or C<eof> may cause confusion.
es_es: sysseek() omite el búfer normal de E/S, por lo que mezclarlo con lecturas que no sean C<sysread> (por ejemplo C<< <> >> o read()) puede confundir a C<print>, C<write>, C<seek>, C<tell>, o C<eof>.

source: If this is true of an operation it will be mentioned in the documentation for that operation.
es_es: Si esto es cierto para una determinada operación, entonces estará mencionado en la documentación de esa operación.

source: To be safe, you may need to set C<$|> ($AUTOFLUSH in English) or call the C<autoflush()> method of C<IO::Handle> on any open handles.
es_es: Para estar seguro, es posible que necesite el conjunto C<|> ($AUTOFLUSH en English) o llame al método C<autoflush()> de C<IO::Handle> en cualquier identificador abierto.

source: The C<ext/Socket/t/socketpair.t> test fails.
es_es: El test C<ext/Socket/t/socketpair.t> falla.

source: =head2 Mailing list for Perl on VM/ESA
es_es: =head2 Lista de correo de Perl en VM/ESA

source: As a shortcut C<(*MARK:NAME)> can be written C<(*:NAME)>.
es_es: Como método abreviado C<(*MARK:NOMBRE)> se puede escribir como C<(*:NOMBRE)>.

source: We can reduce some of the looping through slices
es_es: Podemos reducir algunos de los bucles usando porciones

source: The fix is to re-compile and re-install the modules using 5.8.2.
es_es: La solución es volver a compilar y volver a instalar los módulos usando 5.8.2.

source: (Contributed by Salvador FandiÃ±o GarcÃ­a.)
es_es: (Escrito por Salvador Fandiño García.)

source: (This improvement was actually in 5.8.7, but was accidentally omitted from L<perl587delta>).
es_es: (Esta mejora fue hecha en realidad en 5.8.7, pero se omitió accidentalmente a partir de L<perl587delta>).

source: Declares the BLOCK or the rest of the compilation unit as being in the given namespace.
es_es: Declara el BLOQUE o el resto de la unidad de compilación como pertenecientes al espacio de nombres especificado.

source: As this could cause problems when C<goto> jumps were involved, this change was backed out.
es_es: Ya que esto podría causar problemas cuando intervenían saltos C<goto>, este cambio ha sido desechado.

source: or die "system @args failed: $?"
es_es: or die "system @args falló: $?"

# print "@array contains $count copies of 'foo' ";
source: print "\@array contains $count copies of 'foo'\n";
es_es: print "\@array contiene $cuenta copias de 'foo'\n";

source: s/\d+/$&*2/e; # yields 'abc246xyz'
es_es: s/\d+/$&*2/e; # queda como 'abc246xyz'

source: It is also exempt from the normal B<-w> warnings on improper numeric conversions.
es_es: También es una excepción en el sistema de avisos B<-w> sobre conversiones numéricas impropias.

source: However, waiting for a particular pid with FLAGS of C<0> is implemented everywhere.
es_es: Sin embargo, esperar por un particular pid con BANDERAS a C<0> está implementado en todas partes.

source: It fails and returns false only if the command does not exist I<and> it is executed directly instead of via your system's command shell (see below).
es_es: Fallará y devolverá falso sólo si el comando no existe I<y> es ejecutado directamente en lugar de hacerlo con el shell de comandos del sistema (ver abajo).

source: A series of characters matches that series of characters in the target string, so the pattern C<blurfl> would match "blurfl" in the target string.
es_es: Una serie de caracteres coincide con la serie de caracteres en la cadena objetivo, por lo que el patrón C<blurfl> coincidiría con "blurfl" en la cadena objetivo.

source: Copyright (c) 2000 Mark Kvale All rights reserved.
es_es: Copyright (c) 2000 Mark Kvale. Todos los derechos reservados.

source: That's because in PerlThink, the righthand side of an C<s///> is a double-quoted string.
es_es: Eso es porque en el Pensamiento Perliano, el lado derecho de un C<s///> es una cadena entrecomillada doble.

source: To enable it, it's necessary to pass the argument C<-Dmad> to Configure.
es_es: Para activarlo, es necesario pasar el argumento C<-Dmad> a Configure.

source: README.riscos - Perl version 5 for RISC OS
es_es: README.riscos - Perl versión 5 para sistemas operativos RISC

source: If it's run from a terminal, F<perldoc> will usually call F<pod2man> to translate POD (Plain Old Documentation - see L<perlpod> for an explanation) into a manpage, and then run F<man> to display it; if F<man> isn't available, F<pod2text> will be used instead and the output piped through your favourite pager.
es_es: Cuando se ejecuta desde un terminal, normalmente F<perldoc> llama a F<pod2man> para convertir el formato POD (Plain Old Documentation; consulte L<perlpod> para ver una descripción) en una página de manual, y después ejecuta F<man> para mostrarla; si F<man> no está disponible, se usa F<pod2text> y el resultado se canaliza a través de su paginador favorito.

source: \x1b [2,8] restricted range hex char (example: ESC)
es_es: \x1b [2,8] rango restringido car. hex (example: ESC)

source: This ensures crypt() will hash the new string with the same salt as the digest.
es_es: Esto asegura que crypt() hará el hash de la nueva cadena con el mismo salto que el I<digest>.

source: The C<use diagnostics> pragma automatically turns Perl's normally terse warnings and errors into these longer forms.
es_es: El pragma C<use diagnostics> convierte automáticamente las advertencias y errores de Perl, normalmente escuetos, en estos mensajes más desarrollados.

source: If the operands to a binary bitwise op are strings of different sizes, B<|> and B<^> ops act as though the shorter operand had additional zero bits on the right, while the B<&> op acts as though the longer operand were truncated to the length of the shorter.
es_es: Si los operandos a una operación bit a bit binaria son cadenas de diferentes tamaños, los operadores B<|> y B<^> actúan como si el operando más corto tuviera más bit cero a la derecha, mientras que el operador B<&> actúa como si el operando más largo fuera truncado a la longitud de la menor.

source: If CLASSNAME is omitted, the current package is used.
es_es: Si se omite NOMBRECLASE, se usa el paquete actual.

source: (Or because the Bourne shell is more familiar to you than I<csh>, so writing C<for> comes more naturally.) If VAR is omitted, C<$_> is set to each value.
es_es: (O si le es más familiar el shell Bourne que el I<csh>, escribir C<for> le será más natural). Si VAR se omite, C<$_> se inicializa con cada valor.

source: It can't be used to get out of a block or subroutine given to C<sort>.
es_es: No se puede utilizar para salir de un bloque o una subrutina pasada a C<sort>.

source: r Return the modified string and leave the original string
es_es: r Devuelve la cadena modificada dejando la cadena original

source: =head2 What is Perl 6?
es_es: =head2 ¿Qué es Perl 6?

source: Well, the arguments to a subroutine are available to us as a special array called C<@_> (see L<perlvar> for more on that).
es_es: Los argumentos pasados a una subrutina están disponibles en un array especial denominado C<@_> (consulte L<perlvar> para obtener más información).

source: The exceptions to this rule are when the file or directory should be kept private (mail files, for instance).
es_es: Las excepciones a esta regla son cuando el archivo o directorio debe mantenerse privados (archivos de correo, por ejemplo).

source: Within search patterns (which also undergo double-quotish substitution) there is an unfortunate ambiguity: Is C</$foo[bar]/> to be interpreted as C</${foo}[bar]/> (where C<[bar]> is a character class for the regular expression) or as C</${foo[bar]}/> (where C<[bar]> is the subscript to array @foo)?
es_es: Dentro de los patrones de búsqueda (que también están bajo la sustitución del entrecomillado doble) existe una desafortunada ambigüedad: ¿Debe C</$foo[bar]/> ser interpretado como C</${foo}[bar]/> (donde C<[bar]> es una clase carácter para la expresión regular) o como C</${foo[bar]}/> (donde C<[bar]> es el subíndice del array @foo)?

source: ISBN 978-1-56592-716-2 [1st edition January 2002]
es_es: ISBN 978-1-56592-716-2 [1ª edición - Enero de 2002]

source: Choose a sensible and consistent version numbering scheme (X.YY is the common Perl module numbering scheme)
es_es: Elija una sensata y coherente esquema de numeración de versiones (X.YY es el esquema de numeración normal para los módulos Perl)

source: ActivePerl is a pre-compiled version of Perl ready-to-use.
es_es: ActivePerl es una versión precompilada de Perl, lista para usar.

source: if ($@) { $INC{$filename} = undef; die $@;
es_es: if ($@) { $INC{$archivo} = undef; die $@;

source: @a = ()[1,0]; # @a has no elements
es_es: @a = ()[1,0]; # @a no tiene elementos

source: The actual random order is subject to change in future versions of Perl, but it is guaranteed to be in the same order as either the C<keys> or C<values> function would produce on the same (unmodified) hash.
es_es: El actual orden aleatorio está sujeto a cambio en futuras versiones de Perl, pero se garantiza que sea el mismo orden que las funciones C<keys> o C<values> producirían (mientras que el hash no haya sido modificado).

source: Note that the file will not be included twice under the same specified name.
es_es: Tenga en cuenta que el archivo no será incluido dos veces con el mismo nombre especificado.

source: perlfaq5 Files and Formats
es_es: perlfaq5 Archivos y formatos

source: It returns true on success, false otherwise.
es_es: Devuelve verdadero si tuvo éxito, sino, falso.

source: =item given BLOCK
es_es: =item given BLOQUE

source: Do note that the examples have been written by many different authors over a period of several decades.
es_es: Tenga en cuenta que los ejemplos han sido escritos por muchos autores distintos a lo largo de varias décadas.

source: The first version of this document appeared on Perl Monks, where several people had useful suggestions.
es_es: La primera versión de este documento se publicó en Perl Monks, donde muchas personas realizaron útiles sugerencias.

# print "Binary " if -B _;
source: print "Binary\n" if -B _;
es_es: print "Binario\n" if -B _;

source: and this all reduces to one string internally.
es_es: y todo esto se reduce a una sola cadena, internamente.

source: =item split /PATTERN/,EXPR
es_es: =item split /PATRÓN/,EXPR

source: For a platform independent C<move> function look at the L<File::Copy> module.
es_es: Para una función independiente de la plataforma vea C<move> en el módulo L<File::Copy>.

source: print join(':', split(/(?=\w)/, 'hi there!'));
es_es: print join(':', split(/(?=\w)/, 'hola por aqui!'));

source: If EXPR is omitted, evaluates C<$_>.
es_es: Si EXPR se omite, se evalúa C<$_>.

source: (C<\v> does have meaning in regular expression patterns in Perl, see L<perlre>.)
es_es: (C<\v> tiene significado en los patrones de las expresiones regulares en Perl, vea L<perlre>).

source: Some people may wish to outlaw barewords entirely.
es_es: Algunas personas tal vez deseen prohibir palabras sueltas por completo.

source: $obj->do_something(undef, undef, undef, undef, undef, undef, 1024);
es_es: $obj->hacer_algo(undef, undef, undef, undef, undef, undef, 1024);

source: my @files = File::Find::Rule->
es_es: my @archivos = File::Find::Rule->

source: perl5131delta Perl changes in version 5.13.1
es_es: perl5131delta Cambios en la versión 5.13.1

source: In list context, it's just the list argument separator, and inserts both its arguments into the list.
es_es: En contexto lista, es solo el separador de la lista de argumentos, e inserta sus argumentos en la lista.

source: See L<perlrecharclass/Negation>.
es_es: Vea L<perlrecharclass/Negación>.

source: my @parameters = @$arrayref[1..$#$arrayref];
es_es: my @parametros = @$arrayref[1..$#$arrayref];

source: (In particular, calling values() in void context resets the iterator with no other overhead.
es_es: (De forma particular, llamando a values() en contexto nulo (void) resetea el iterador sin otro efecto.

source: =item Other regexp features
es_es: =item Otras características de las expresiones regulares

source: It usually works out better for flow control than in assignments:
es_es: Por lo general, funciona mejor para el control flujo que en las asignaciones:

source: For example, we have F<lib/strict.pm> and F<lib/strict.t>.
es_es: Por ejemplo, tenemos F<lib/strict.pm> y F<lib/strict.t>.

source: Negative values give the Unicode replacement character (chr(0xfffd)), except under the L<bytes> pragma, where the low eight bits of the value (truncated to an integer) are used.
es_es: Valores negativos dan el carácter de reemplazo Unicode (chr(0xfffd)), salvo bajo el pragma L<bytes>, donde se utilizan los ocho bits más bajos del valor (truncado a un entero).

source: See also the POSIX module's C<pause> function.
es_es: Vea también la función C<pause> del módulo POSIX.

source: A string enclosed by backticks (grave accents) first undergoes double-quote interpolation.
es_es: Una cadena delimitada por comillas simples invertidas (acentos graves) se somete a una primera interpolación de entrecomillado doble.

source: > sSiIlLqQ Force big-endian byte-order on the type.
es_es: > sSiIlLqQ Fuerza un orden de bytes en big-endian.
